{
  "title": "Ingevity to build activated-carbon extrusion plant in China",
  "text": "Ingevity Corp. (North Charleston, S.C.; www.ingevity.com) announced that it will build a new activated-carbon extrusion plant in Changshu, China, to meet growing global demand for pelletized carbon products primarily for use in gasoline vapor emission control systems in cars, trucks, motorcycles and boats.\n\nThis state-of-the-art extrusion facility is a key element of the strategy and capital investment plan for our Performance Materials segment, said Michael Wilson, Ingevity’s president and CEO. The Changshu facility will leverage our current capacity for activated carbon in time to meet greater demand in the automotive industry. By converting our powdered carbon into pellet form, we can increase volumes serving the higher value, automotive industry. The organic growth opportunity in our Performance Materials segment’s automotive applications continues to be the company’s top investment priority.\n\n The new facility will be located in Changshu city within the Jiangsu province. It is expected to be operational by the fall of 2018 and will employ about 80 people. The plant represents an investment of approximately $20 million, the majority of which will be incurred in 2018. Initially, it will feature one extrusion line that produces pelletized activated carbon products. The new plant will complement the existing extrusion facility in Wuijang, China, and activated carbon plants in Zhuhai, China, Wickliffe, Ky., and Covington, Va., as well as the honeycomb scrubber joint venture plant in Waynesboro, Ga. The facility will be able to accommodate an additional extrusion line as demand continues to grow.\n\n With the introduction of newer, more stringent regulations for automotive gasoline vapor emissions control in both China and Europe, we are anticipating a substantial increase in global demand for our automotive activated carbon products, said Ed Woodcock, executive vice president and president, Performance Materials.",
  "url": "http://www.chemengonline.com/ingevity-to-build-activated-carbon-extrusion-plant-in-china/"
}
